Информационная_база/src/Catalogs/ВидыНачисленийИУдержаний/ВидыНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНачисленийИУдержаний</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ПФРПоСуммарномуТарифу</name>
      <description>Взносы в ПФР  с 1 января 2014 года</description>
    </items>
    <items>
      <name>ПФРНакопительная</name>
      <description>Взносы в ПФР- накопительная часть(до 2014 года)</description>
    </items>
    <items>
      <name>ПФРСтраховая</name>
      <description>Взносы в ПФР- страховая часть(до 2014 года)</description>
    </items>
    <items>
      <name>ФСС</name>
      <description>Взносы в ФСС (временная нетрудоспособность)</description>
    </items>
    <items>
      <name>ФССНесчастныеСлучаи</name>
      <description>Взносы в ФСС (несчастные случаи)</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Взносы в ФФОМС</description>
    </items>
    <items>
      <name>НалогНаДоходы</name>
      <description>Налог на доходы</description>
    </items>
    <items>
      <name>СдельнаяОплата</name>
      <description>Сдельная оплата</description>
    </items>
    <items>
      <name>СдельнаяОплатаПроцент</name>
      <description>Сдельная оплата (процент)</description>
    </items>
    <items>
      <name>ФиксированнаяСумма</name>
      <description>Сдельная оплата (фиксированная сумма)</description>
    </items>
    <items>
      <name>ПогашениеЗаймаИзЗарплаты</name>
      <description>Погашение займа из зарплаты</description>
    </items>
    <items>
      <name>ПроцентыПоЗайму</name>
      <description>Проценты по займу</description>
    </items>
  </predefined>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДоходаНДФЛ</name>
    <type>
      <types>CatalogRef.КодыДоходовНДФЛ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоходаПоСтраховымВзносам</name>
    <type>
      <types>CatalogRef.ВидыДоходовПоСтраховымВзносам</types>
    </type>
  </attributes>
</mdclass:Catalog>

Информационная_база/src/Enums/ТипыНачисленийИУдержаний/ТипыНачисленийИУдержаний.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНачисленийИУдержаний</name>
  <enumValues>
    <name>Начисление</name>
  </enumValues>
  <enumValues>
    <name>Удержание</name>
  </enumValues>
  <enumValues>
    <name>Налог</name>
  </enumValues>
</mdclass:Enum>

Информационная_база/src/ChartsOfAccounts/Управленческий/Управленческий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Управленческий</name>
  <predefined>
    <items>
      <name>Служебный</name>
      <description>Служебный</description>
      <code>00      </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ВнеоборотныеАктивы</name>
      <description>Имущество</description>
      <code>01      </code>
    </items>
    <items>
      <name>АмортизацияВнеоборотныхАктивов</name>
      <description>Амортизация имущества</description>
      <code>02      </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>ВложенияВоВнеоборотныеАктивы</name>
      <description>Вложения в имущество</description>
      <code>08      </code>
    </items>
    <items>
      <name>СырьеИМатериалы</name>
      <description>Сырье и материалы</description>
      <code>10      </code>
    </items>
    <items>
      <name>НезавершенноеПроизводство</name>
      <description>Незавершенное производство</description>
      <code>20      </code>
    </items>
    <items>
      <name>КосвенныеЗатраты</name>
      <description>Косвенные затраты</description>
      <code>25      </code>
    </items>
    <items>
      <name>ТоварыПродукция</name>
      <description>Товары, продукция</description>
      <code>41      </code>
    </items>
    <items>
      <name>ТорговаяНаценка</name>
      <description>Торговая наценка</description>
      <code>42      </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50      </code>
    </items>
    <items>
      <name>Банк</name>
      <description>Банк</description>
      <code>51      </code>
    </items>
    <items>
      <name>ПереводыВПути</name>
      <description>Переводы в пути</description>
      <code>57      </code>
    </items>
    <items>
      <name>ФинансовыеВложения</name>
      <description>Финансовые вложения</description>
      <code>58      </code>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчиками</description>
      <code>60      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками</description>
        <code>60.01   </code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамВыданным</name>
        <description>Расчеты по авансам выданным</description>
        <code>60.02   </code>
      </childItems>
    </items>
    <items>
      <name>РасчетыСПокупателямиИЗаказчиками</name>
      <description>Расчеты с покупателями и заказчиками</description>
      <code>62      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПокупателями</name>
        <description>Расчеты с покупателями</description>
        <code>62.01   </code>
      </childItems>
      <childItems>
        <name>РасчетыПоАвансамПолученным</name>
        <description>Расчеты по авансам полученным</description>
        <code>62.02   </code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>РасчетыПоКраткосрочнымКредитамИЗаймам</name>
      <description>Расчеты по краткосрочным кредитам и займам</description>
      <code>66      </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыПоДолгосрочнымКредитамИЗаймам</name>
      <description>Расчеты по долгосрочным кредитам и займам</description>
      <code>67      </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыПоНалогам</name>
      <description>Расчеты по налогам</description>
      <code>68      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>Налоги</name>
        <description>Налоги</description>
        <code>68.01   </code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>НалогиКВозмещению</name>
        <description>Налоги к возмещению</description>
        <code>68.02   </code>
      </childItems>
    </items>
    <items>
      <name>РасчетыСПерсоналомПоОплатеТруда</name>
      <description>Расчеты с персоналом по оплате труда</description>
      <code>70      </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РасчетыСПодотчетнымиЛицами</name>
      <description>Расчеты с подотчетными лицами</description>
      <code>71      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСПодотчетниками</name>
        <description>Авансы, выданные подотчетным лицам</description>
        <code>71.01   </code>
      </childItems>
      <childItems>
        <name>ПерерасходПодотчетников</name>
        <description>Перерасход подотчетных лиц</description>
        <code>71.02   </code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>РасчетыСПерсоналомПоПрочимОперациям</name>
      <description>Расчеты с персоналом по прочим операциям</description>
      <code>73      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыПоПредоставленнымЗаймам</name>
        <description>Расчеты по предоставленным займам</description>
        <code>73.01   </code>
      </childItems>
      <childItems>
        <name>РасчетыПоВозмещениюМатериальногоУщерба</name>
        <description>Расчеты по возмещению материального ущерба</description>
        <code>73.02   </code>
      </childItems>
    </items>
    <items>
      <name>РасчетыСУчредителями</name>
      <description>Расчеты с учредителями</description>
      <code>75      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыПоВкладамВУставныйКапитал</name>
        <description>Расчеты по вкладам в уставный капитал</description>
        <code>75.01   </code>
      </childItems>
      <childItems>
        <name>РасчетыПоВыплатеДоходов</name>
        <description>Расчеты по выплате доходов</description>
        <code>75.02   </code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>РасчетыСРазнымиДебиторамиИКредиторами</name>
      <description>Расчеты с разными дебиторами и кредиторами</description>
      <code>76      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>РасчетыСРазнымиДебиторами</name>
        <description>Расчеты с разными дебиторами</description>
        <code>76.01   </code>
      </childItems>
      <childItems>
        <name>РасчетыСРазнымиКредиторами</name>
        <description>Расчеты с разными кредиторами</description>
        <code>76.02   </code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>РасчетыСПрочимиПоставщикамиИТаможеннымиОрганами</name>
        <description>Расчеты с прочими поставщиками и таможенными органами</description>
        <code>76.05   </code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
    <items>
      <name>УставныйКапитал</name>
      <description>Уставный капитал</description>
      <code>80      </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>РезервныйИДобавочныйКапитал</name>
      <description>Резервный и добавочный капитал</description>
      <code>82      </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НераспределеннаяПрибыль</name>
      <description>Нераспределенная прибыль (непокрытый убыток)</description>
      <code>84      </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Продажи</name>
      <description>Продажи</description>
      <code>90      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ВыручкаОтПродаж</name>
        <description>Выручка от продаж</description>
        <code>90.01   </code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>СебестоимостьПродаж</name>
        <description>Себестоимость продаж</description>
        <code>90.02   </code>
      </childItems>
      <childItems>
        <name>КоммерческиеРасходы</name>
        <description>Коммерческие расходы</description>
        <code>90.07   </code>
      </childItems>
      <childItems>
        <name>УправленческиеРасходы</name>
        <description>Управленческие расходы</description>
        <code>90.08   </code>
      </childItems>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходы</name>
      <description>Прочие доходы и расходы</description>
      <code>91      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПрочиеДоходы</name>
        <description>Прочие доходы</description>
        <code>91.01   </code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>ПрочиеРасходы</name>
        <description>Прочие расходы</description>
        <code>91.02   </code>
      </childItems>
      <childItems>
        <name>ПроцентыПоКредитам</name>
        <description>Проценты по кредитам</description>
        <code>91.03   </code>
      </childItems>
    </items>
    <items>
      <name>НедостачиИПотериОтПорчиЦенностей</name>
      <description>Недостачи и потери от порчи ценностей</description>
      <code>94      </code>
    </items>
    <items>
      <name>РасходыБудущихПериодов</name>
      <description>Расходы будущих периодов</description>
      <code>97      </code>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>99      </code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ПрибылиИУбыткиБезНалогаНаПрибыль</name>
        <description>Прибыли и убытки (за исключением налога на прибыль)</description>
        <code>99.01   </code>
        <accountType>ActivePassive</accountType>
      </childItems>
      <childItems>
        <name>ПрибылиИУбытки_НалогНаПрибыль</name>
        <description>Налог на прибыль</description>
        <code>99.02   </code>
        <accountType>ActivePassive</accountType>
      </childItems>
    </items>
  </predefined>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>EnumRef.ТипыСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределения</name>
    <type>
      <types>EnumRef.БазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗакрытия</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходовИРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СчетаУчета</name>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Управленческий</types>
      </type>
    </attributes>
  </tabularSections>
  <accountingFlags>
    <name>Валютный</name>
    <comment>Валютный</comment>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
</mdclass:ChartOfAccounts>

Информационная_база/src/Catalogs/ВидыНачисленийИУдержаний/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция возвращает список имен «ключевых» реквизитов.
//
Функция ПолучитьБлокируемыеРеквизитыОбъекта() Экспорт
	
	Результат = Новый Массив;
	Результат.Добавить("ВидНалога");
	Результат.Добавить("Тип");
	
	Возврат Результат;
	
КонецФункции // ПолучитьБлокируемыеРеквизитыОбъекта()

Процедура ДополнитьВидыНачислений() Экспорт
		
		Группа = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("Начисления");
		
		Если Не ЗначениеЗаполнено(Группа) или не Группа.ЭтоГруппа Тогда
			ГруппаНачисление = Справочники.ВидыНачисленийИУдержаний.ПустаяСсылка();
		Иначе
			ГруппаНачисление = Группа;
		КонецЕсли;
		
		НайденныйЭлементСправочника = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("Оклад по дням (график работы сотрудника)");
		
		Если Не ЗначениеЗаполнено(НайденныйЭлементСправочника) Тогда
			
			// Оклад по дням Графики
			НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
			НовоеНачисление.Родитель 			= ГруппаНачисление;
			НовоеНачисление.Наименование 		= "Оклад по дням (график работы сотрудника)";
			НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
			НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.УправленческиеРасходы;
			НовоеНачисление.Формула				= "[ТарифнаяСтавка] * [ОтработаноДней] / [НормаДнейГрафикСотрудника]";
			НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
			НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
			НовоеНачисление.Записать();
			
		КонецЕсли;
		
		НайденныйЭлементСправочника = Справочники.ВидыНачисленийИУдержаний.НайтиПоНаименованию("Оклад по часам (график работы сотрудника)");
		
		Если Не ЗначениеЗаполнено(НайденныйЭлементСправочника) Тогда
			
			// Оклад по часам Графики
			НовоеНачисление 					= Справочники.ВидыНачисленийИУдержаний.СоздатьЭлемент();
			НовоеНачисление.Родитель 			= ГруппаНачисление;
			НовоеНачисление.Наименование 		= "Оклад по часам (график работы сотрудника)";
			НовоеНачисление.Тип 				= Перечисления.ТипыНачисленийИУдержаний.Начисление;
			НовоеНачисление.СчетЗатрат			= ПланыСчетов.Управленческий.КосвенныеЗатраты;
			НовоеНачисление.Формула 			= "[ТарифнаяСтавка] * [ОтработаноЧасов] / [НормаЧасовГрафикСотрудника]";
			НовоеНачисление.КодДоходаНДФЛ		= Справочники.КодыДоходовНДФЛ.Код2000;
			НовоеНачисление.ВидДоходаПоСтраховымВзносам = Справочники.ВидыДоходовПоСтраховымВзносам.ОблагаетсяЦеликом;
			НовоеНачисление.Записать();
			
		КонецЕсли
		
	КонецПроцедуры

#КонецЕсли
